<template>
  <div class="content">
    <h2>捕获组</h2>
    <table class="table">
      <tbody>
        <tr>
          <th width="100">
            名称
          </th>
          <th>描述</th>
        </tr>
        <tr>
          <td>捕获组 (xxxx) </td>
          <td>
            <p>一般使用小括号括起来就会成为捕获组。</p>
            <p>特殊情况：小括号中开头使用了量词中的断言，如：?=n、?!n等，以及小括号中开头使用了专门标识不是捕获组的?:</p>
            <p>这个分组有两个作用：一是将多个字符视为一个整体，二是"记住"它匹配到的具体内容，以便后续引用。</p>
            <p>捕获组可以各自独立也可互相嵌套，以先出现左小括号为顺序。示例看查看方法：characterRepeat。</p>
            <p>匹配结果：$&amp;(整个正则匹配到的完整文本)，严格上来说它和捕获组无关。</p>
            <p>数字引用：以小括号出现的先后顺序划分：$1(第一个捕获组)、……。</p>
            <p>示例：'Hello Word!'.replace(/(Hello).*(Word)/g,'$2 $1') // 引用互换$1 $2，结果为： Word Hello! </p>
            <p>具名引用：小括号前添加具体的名称，格式为?&lt;xxx&gt;，引用的地方$&lt;xxx&gt;。</p>
            <p>示例：'2025-11-26'.replace(/(?&lt;year&gt;\d{4})-(?&lt;month&gt;\d{2})-(?&lt;day&gt;\d{2})/g,'$&lt;day&gt;/$&lt;month&gt;/$&lt;year&gt;')。</p>
          </td>
        </tr>
        <tr>
          <td>反向引用、模式内引用 \n</td>
          <td>
            <p>用在正则表达式中，匹配前面第n个捕获组捕获的字符。</p>
            <p>数字反向引用：\1是一种特殊的表示法，它代表第一个捕获组所匹配到的那个确切的字符。注意，\1必须与捕获组配合使用，它引用的是分组匹配到的具体内容，而不是分组本身的正则模式。\2代表第二个捕获组所匹配到的那个确切的字符。</p>
            <p>具名反向引用：\k&lt;xxx&gt;</p>
            <p>一般后面会结合量词使用：*（零个或多个）、+（一个或多个），匹配到的结果是连续的字符（*时有可能是单个字符）。</p>
          </td>
        </tr>
      </tbody>
    </table>
  </div>
</template>
